Revit 2026 API

# RevisionCloudCreate Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static RevisionCloud Create(
	Document document,
	View view,
	ElementId revisionId,
	IList<Curve> curves
)
```
```vb
Public Shared Function Create (
	document As Document,
	view As View,
	revisionId As ElementId,
	curves As IList(Of Curve)
) As RevisionCloud
```
```cpp
public:
static RevisionCloud^ Create(
	Document^ document,
	View^ view,
	ElementId^ revisionId,
	IList<Curve^>^ curves
)
```
```fsharp
static member Create :
        document : Document *
        view : View *
        revisionId : ElementId *
        curves : IList<Curve> -> RevisionCloud
```

#### Parameters

document Document

view View

revisionId ElementId

curves IListCurve

#### Return Value

RevisionCloud

#### Reference

RevisionCloud Class

Autodesk.Revit.DB Namespace